# Mack Aprendizado Não Supervisionado - Revisão Pandas¶

Criando um Dataframe a partir de um arquivo csv e apresentando as 5 primeiras linhas

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('employees.csv')

In [3]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

2)Retire as amostras com missings

1)Obtenha informações gerais do dataframe (quantidade, nulos, tipos etc.)

In [9]:
df=df.dropna()

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 764 entries, 0 to 999
Data columns (total 8 columns):
First Name           764 non-null object
Gender               764 non-null object
Start Date           764 non-null object
Last Login Time      764 non-null object
Salary               764 non-null int64
Bonus %              764 non-null float64
Senior Management    764 non-null object
Team                 764 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 53.7+ KB

3)Obtenha a média da série "Salary"

90662.181

4)Quantos homens e quantas mulheres?

5)Crie uma nova coluna (série) "Bonus"..Inicialmente todos terão valor 500

6)Quantas mulheres ganham acima da média da empresa?

381

7)Apresente os dados de todas as Marias da empresa

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Bonus
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,500
198,Maria,Female,12/27/1990,9:57 PM,36067,9.640,True,Product,500
936,Maria,Female,3/14/2003,5:23 PM,96250,10.056,False,Business Development,500
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering,500